{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "ppi"}, "name": "ppi", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "width_ratio"}, "name": "width_ratio", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "height_ratio"}, "name": "height_ratio", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "display_screen_size"}, "name": "display_screen_size", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "font_height"}, "name": "font_height", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "char_width"}, "name": "char_width", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "font_dp"}, "name": "font_dp", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "density_bucket_0"}, "name": "density_bucket_0", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "density_bucket_1"}, "name": "density_bucket_1", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "density_bucket_2"}, "name": "density_bucket_2", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "density_bucket_3"}, "name": "density_bucket_3", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "density_bucket_4"}, "name": "density_bucket_4", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_0"}, "name": "element_type_0", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_1"}, "name": "element_type_1", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_2"}, "name": "element_type_2", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_3"}, "name": "element_type_3", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_4"}, "name": "element_type_4", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_5"}, "name": "element_type_5", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_6"}, "name": "element_type_6", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_7"}, "name": "element_type_7", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_8"}, "name": "element_type_8", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_9"}, "name": "element_type_9", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_10"}, "name": "element_type_10", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_11"}, "name": "element_type_11", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_12"}, "name": "element_type_12", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_13"}, "name": "element_type_13", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_14"}, "name": "element_type_14", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_15"}, "name": "element_type_15", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_16"}, "name": "element_type_16", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_17"}, "name": "element_type_17", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_18"}, "name": "element_type_18", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_19"}, "name": "element_type_19", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_20"}, "name": "element_type_20", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_21"}, "name": "element_type_21", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "element_type_22"}, "name": "element_type_22", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "screen_part_0"}, "name": "screen_part_0", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "screen_part_1"}, "name": "screen_part_1", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "screen_part_2"}, "name": "screen_part_2", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "screen_part_3"}, "name": "screen_part_3", "inbound_nodes": []}, {"class_name": "Normalization", "config": {"name": "normalization", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization", "inbound_nodes": [[["ppi", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_1", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_1", "inbound_nodes": [[["width_ratio", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_2", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_2", "inbound_nodes": [[["height_ratio", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_3", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_3", "inbound_nodes": [[["display_screen_size", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_4", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_4", "inbound_nodes": [[["font_height", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_5", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_5", "inbound_nodes": [[["char_width", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_6", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_6", "inbound_nodes": [[["font_dp", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_7", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_7", "inbound_nodes": [[["density_bucket_0", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_8", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_8", "inbound_nodes": [[["density_bucket_1", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_9", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_9", "inbound_nodes": [[["density_bucket_2", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_10", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_10", "inbound_nodes": [[["density_bucket_3", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_11", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_11", "inbound_nodes": [[["density_bucket_4", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_12", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_12", "inbound_nodes": [[["element_type_0", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_13", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_13", "inbound_nodes": [[["element_type_1", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_14", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_14", "inbound_nodes": [[["element_type_2", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_15", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_15", "inbound_nodes": [[["element_type_3", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_16", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_16", "inbound_nodes": [[["element_type_4", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_17", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_17", "inbound_nodes": [[["element_type_5", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_18", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_18", "inbound_nodes": [[["element_type_6", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_19", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_19", "inbound_nodes": [[["element_type_7", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_20", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_20", "inbound_nodes": [[["element_type_8", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_21", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_21", "inbound_nodes": [[["element_type_9", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_22", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_22", "inbound_nodes": [[["element_type_10", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_23", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_23", "inbound_nodes": [[["element_type_11", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_24", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_24", "inbound_nodes": [[["element_type_12", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_25", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_25", "inbound_nodes": [[["element_type_13", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_26", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_26", "inbound_nodes": [[["element_type_14", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_27", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_27", "inbound_nodes": [[["element_type_15", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_28", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_28", "inbound_nodes": [[["element_type_16", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_29", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_29", "inbound_nodes": [[["element_type_17", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_30", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_30", "inbound_nodes": [[["element_type_18", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_31", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_31", "inbound_nodes": [[["element_type_19", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_32", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_32", "inbound_nodes": [[["element_type_20", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_33", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_33", "inbound_nodes": [[["element_type_21", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_34", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_34", "inbound_nodes": [[["element_type_22", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_35", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_35", "inbound_nodes": [[["screen_part_0", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_36", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_36", "inbound_nodes": [[["screen_part_1", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_37", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_37", "inbound_nodes": [[["screen_part_2", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_38", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "name": "normalization_38", "inbound_nodes": [[["screen_part_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["normalization", 0, 0, {}], ["normalization_1", 0, 0, {}], ["normalization_2", 0, 0, {}], ["normalization_3", 0, 0, {}], ["normalization_4", 0, 0, {}], ["normalization_5", 0, 0, {}], ["normalization_6", 0, 0, {}], ["normalization_7", 0, 0, {}], ["normalization_8", 0, 0, {}], ["normalization_9", 0, 0, {}], ["normalization_10", 0, 0, {}], ["normalization_11", 0, 0, {}], ["normalization_12", 0, 0, {}], ["normalization_13", 0, 0, {}], ["normalization_14", 0, 0, {}], ["normalization_15", 0, 0, {}], ["normalization_16", 0, 0, {}], ["normalization_17", 0, 0, {}], ["normalization_18", 0, 0, {}], ["normalization_19", 0, 0, {}], ["normalization_20", 0, 0, {}], ["normalization_21", 0, 0, {}], ["normalization_22", 0, 0, {}], ["normalization_23", 0, 0, {}], ["normalization_24", 0, 0, {}], ["normalization_25", 0, 0, {}], ["normalization_26", 0, 0, {}], ["normalization_27", 0, 0, {}], ["normalization_28", 0, 0, {}], ["normalization_29", 0, 0, {}], ["normalization_30", 0, 0, {}], ["normalization_31", 0, 0, {}], ["normalization_32", 0, 0, {}], ["normalization_33", 0, 0, {}], ["normalization_34", 0, 0, {}], ["normalization_35", 0, 0, {}], ["normalization_36", 0, 0, {}], ["normalization_37", 0, 0, {}], ["normalization_38", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_3", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}], "input_layers": [["ppi", 0, 0], ["width_ratio", 0, 0], ["height_ratio", 0, 0], ["display_screen_size", 0, 0], ["font_height", 0, 0], ["char_width", 0, 0], ["font_dp", 0, 0], ["density_bucket_0", 0, 0], ["density_bucket_1", 0, 0], ["density_bucket_2", 0, 0], ["density_bucket_3", 0, 0], ["density_bucket_4", 0, 0], ["element_type_0", 0, 0], ["element_type_1", 0, 0], ["element_type_2", 0, 0], ["element_type_3", 0, 0], ["element_type_4", 0, 0], ["element_type_5", 0, 0], ["element_type_6", 0, 0], ["element_type_7", 0, 0], ["element_type_8", 0, 0], ["element_type_9", 0, 0], ["element_type_10", 0, 0], ["element_type_11", 0, 0], ["element_type_12", 0, 0], ["element_type_13", 0, 0], ["element_type_14", 0, 0], ["element_type_15", 0, 0], ["element_type_16", 0, 0], ["element_type_17", 0, 0], ["element_type_18", 0, 0], ["element_type_19", 0, 0], ["element_type_20", 0, 0], ["element_type_21", 0, 0], ["element_type_22", 0, 0], ["screen_part_0", 0, 0], ["screen_part_1", 0, 0], ["screen_part_2", 0, 0], ["screen_part_3", 0, 0]], "output_layers": [["dense_4", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}